Repository: haithembenhalima/yaziji
Catalog: web/locales/*/LC_MESSAGES/main.po
Languages: fr, ja

# اِسْتَطَاعَ
source: Can
fr: Pouvoir
ja: できる

# أَرَادَ
source: Want
fr: Vouloir
ja: ～したい

# كَادَ
source: May
fr: Pouvoir(presque)
ja: ～しそう。～するところだった

# شَرِبَ
source: to Drink
fr: Boire
ja: 飲む

# ضَرَبَ
source: to Hit
fr: Frapper
ja: 打つ

# ذَهَبَ
source: to Go
fr: Aller
ja: 行く

# جَلَسَ
source: to Stand
fr: Assoir
ja: 座る

source: شَبِعَ
ja: 満腹になる

# أَكَلَ
source: eat
ja: 食べる

# خَرَجَ
source: go out
ja: 出かける

# مَشَى
source: walk
ja: 歩く

# قَامَ
source: get up
ja: 立つ

# نَجَحَ
source: to success
ja: 合格する、成功する

# بَكَى
source: cry
ja: 泣く

# سَمِعَ
source: hear
ja: 聞く

# جَاءَ
source: come
ja: 来る

# عَرَفَ
source: know
ja: 知る

# رَسَبَ
source: fail
ja: 不合格になる

# تَعَلَّمَ
source: learn
ja: 学ぶ、教わる

# لَعِبَ
source: play
ja: 遊ぶ、スポーツをする

# جَعَلَ
source: make
ja: ～させる

# شَكَرَ
source: thank
ja: 感謝する、お礼を言う

# جَهَّزَ
source: prepare
ja: 用意する、準備する

# وَعَدَ
source: promise
ja: 約束する

# عَاشَ
source: live
ja: 暮らす、生活を送る

# وَقَفَ
source: stand up
ja: 立つ、止まる

# سَجَدَ
source: prostrate
ja: サジダする

# مَاتَ
source: to die
ja: 死ぬ

# قَبَضَ
source: to catch
ja: 逮捕する

# غَفَرَ
source: forgive
ja: 赦す

# صَامَ
source: to fast
ja: 断食する

# رَسَمَ
source: to draw
ja: 描く

# نَزَلَ
source: to go down
ja: 降りる

# رَكَعَ
source: kneel
ja: ひざまずく

# سَافَرَ
source: to travel
ja: 旅行する

source: وَفَى
ja: 尽くす

# لَبِسَ
source: to wear
ja: 着る、身に付ける、着用する

source: اجْتَهَدَ
ja: 努力する

# وَجَدَ
source: to find
ja: 見つける

# وَصَلَ
source: to arrive
ja: 着く、到着する、たどり着く

# قَرَأَ
source: to read
ja: 読む

# قَعَدَ
source: to sit
ja: 座る

# قَالَ
source: to say
ja: 言う

# خَبَّرَ
source: to tell
ja: パンを焼く

# عَلِمَ
source: to know
ja: 知る

# سَأَلَ
source: to ask
ja: 尋ねる、訊く、質問する

# رَمَى
source: to throw
ja: 投げる、捨てる

# شَاهَدَ
source: to watch
ja: 観る

# أَخَذَ
source: to take
ja: 取る

# طَلَعَ
source: to go up
ja: 昇る、上る、出る

# حَفِظَ
source: to save
ja: 憶える

# أَخْبَرَ
source: to tell
ja: 知らせる

# نَامَ
source: to sleep
ja: 寝る

# سَاعَدَ
source: to assist
ja: 手伝う、助ける

# كَتَبَ
source: to write
ja: 書く

# حَدَّثَ
source: to talk
ja: 話す

# جَرَى
source: to run
ja: 走る

# اشْتَرَى
source: to buy
ja: 買う

# أَسْرَعَ
source: to speed up
ja: 急ぐ

# ذَاكَرَ
source: to revise
ja: 勉強する

# وَضَعَ
source: to put
ja: 置く

# بَاعَ
source: to sell
ja: 売る

# فَهِمَ
source: to understand
ja: 理解する

# فَتَحَ
source: to open
ja: 開く

# عَطِشَ
source: to be thirst
ja: 喉が渇く

# سَكَنَ
source: to inhabit
ja: 住む

# أَعْلَمَ
source: to inform
ja: 知らせる

# كَسَرَ
source: to break down
ja: 壊す

# دَخَلَ
source: to enter
ja: 入る

# الأمر
source: Imperative
fr: Impérative
ja: 命令形

# معلوم
source: Active
fr: Active
ja: 能動態

# مثبت
source: Affirmative
fr: Affirmative
ja: 肯定

# منفي
source: Negative
fr: Négative
ja: 否定

# حَلِيبٌ
source: Milk
fr: Lait
ja: 牛乳

# بَابٌ
source: Door
fr: Porte
ja: ドア

# أنا
source: I
fr: Je
ja: 私

# نحن
source: We
fr: Nous
ja: 私たち

# أنت
source: You (masculine singular)
fr: Tu (masculin)
ja: あなた

# أنتِ
source: You (feminine singular)
fr: Tu (féminin)
ja: あなた（女性）

# أنتما
source: You (dual masculine)
fr: Vous (masculins dual)
ja: あなた（二人）

# أنتم
source: You (plural masculine)
fr: Vous (masculin pluriel)
ja: あなたたち

# أنتن
source: You (plural feminine)
fr: Vous (féminin pluriel)
ja: あなたたち（女性）

# هو
source: He
fr: Il
ja: 彼

# هي
source: She
fr: Elle
ja: 彼女

# هما
source: They (dual masculine)
fr: Ils (masculins dual)
ja: 彼ら

# هم
source: They (masculine)
fr: Ils
ja: 彼ら

# هن
source: They (feminine)
fr: Elles
ja: 彼女ら

# تُفَاحَةٌ
source: apple
ja: りんご

# تِلْمِيذٌ
source: pupil
ja: 生徒

# ثَوْبٌ
source: dress
ja: ドレス

# جَبَلٌ
source: mountain
ja: 山

# حَقِيبَةٌ
source: luggage
ja: かばん

# خُضَرٌ
source: vegetables
ja: 野菜

# دَرْسٌ
source: Lesson
ja: レッスン

# رَجُلٌ
source: man
ja: 男

# شَعْرٌ
source: hair
ja: 毛、髪の毛

# صَحْرَاءٌ
source: desert
ja: 砂漠

# صَوْتٌ
source: sound
ja: 声、音

# طَعَامٌ
source: food
ja: 食べ物

# طَلَبَةٌ
source: Students
ja: 学生

# عَصِيرٌ
source: juice
ja: ジュース

# عَلَمٌ
source: flag
ja: 旗、国旗

# فَوَاكِهٌ
source: fruits
ja: 果物

# قَمَرٌ
source: moon
ja: 月

# قُرْآنٌ
source: Quran
ja: コーラン

# قِصَّةٌ
source: story
ja: 物語

# قِطَّةٌ
source: cat
ja: 猫

# كَأْسٌ
source: cup
ja: カップ

# كُرَةٌ
source: ball
ja: ボール

# كِتَابٌ
source: book
ja: 本

source: لمْرأَةٌ
ja: 女性

# مدْرَسةٌ
source: school
ja: 学校

# مسْرَحِيَّةٌ
source: a play
ja: 遊び

# مُعَلِمٌ
source: Teacher
ja: 教師

# مِحْفَظَةٌ
source: wallet
ja: 財布

# نَاسٌ
source: people
ja: 人々

# أَحْيَانًا
source: Sometimes
fr: parfois
ja: 時々

# البَارِحَةَ
source: yesterday
ja: 昨日

# اليَوْمَ
source: today
ja: 今日

# سَاعَةً
source: hour
ja: 一時間

# سَنَةً
source: year
ja: 一年間

# شِتَاءً
source: winter
ja: 冬

# صَبَاحًا
source: Morning
fr: Le matin
ja: 朝

# صَيْفًا
source: summer
ja: 夏に

source: ظُهْرًا
ja: お昼に

source: عَصْرًا
ja: 夕方

# غَدًا
source: tomorrow
fr: Demain
ja: 明日

# فَجْرًا
source: sun rise
ja: 夜明け

# لَحْظَةَ
source: Moment
ja: 一瞬

# لَيْلًا
source: night
ja: 夜

# مَسَاءً
source: Afternoon
fr: Le soir
ja: 晩に

# نَهْارًا
source: in the day
ja: 日中

# بَيْتٌ
source: house
ja: 家

# حَدِيقَةٌ
source: garden
ja: 公園、庭

# سُوقٌ
source: market
ja: 市場

# طَرِيقٌ
source: road
ja: 道

# غُرْفَةٌ
source: room
ja: 部屋

# فِنَاءٌ
source: Courtyard
ja: 中庭

# مَدِينَةٌ
source: city
ja: 街

# مَدْرَسَةٌ
source: school
ja: 学校

# مَسْجِدٌ
source: Mosque
ja: モスク

# مَطْبَخٌ
source: kitchen
ja: 台所

# أَنِيقٌ
source: elegant
ja: 上品な

# بَخِيلٌ
source: stingy
ja: ケチな

# بَشِعٌ
source: ugly
ja: ひどい

# بَطِيءٌ
source: slow
ja: 遅い

# جَمِيلٌ
source: Beautiful
ja: 美しい

# حَزِينٌ
source: sad
ja: 悲しい

# حَنُونٌ
source: compassionate
ja: 思いやりがある

# ذَكِيٌ
source: smart
ja: 賢い

# سَرِيعٌ
source: fast
ja: 速い

# سَعِيدٌ
source: happy
ja: 幸せな

# سَمِينٌ
source: fat
ja: 太っている

# شُجَاعٌ
source: brave
ja: 勇敢な

# ضَعِيفٌ
source: weak
ja: 弱い

# طَوِيلٌ
source: long
ja: 背が高い

# غَبِيٌ
source: stupid
ja: 馬鹿な

# فَرِحٌ
source: joyful
ja: 喜んでいる

# قَصِيرٌ
source: short
ja: 短い

# قَوِيٌ
source: strong
ja: 強い

# كَرِيمٌ
source: generous
ja: 気前がいい

# كَسُولٌ
source: lazy
ja: 怠けている

# لَئِيمٌ
source: miscreant
ja: ずるい

# مَسْرُورٌ
source: pleased
ja: 嬉しい

# مُبْتَهِجٌ
source: cheery
ja: 陽気な

# مُجْتَهِدٌ
source: diligent
ja: 勤勉な

# مُرْتَفِعٌ
source: high
ja: 高い

# مُنْخَفِضٌ
source: low
ja: 低い

# هَزِيلٌ
source: meager
ja: 痩せている

# وَسِيمٌ
source: Handsome
ja: ハンサム

# أَحْمَد
source: Ahmed
fr: Ahmed
ja: アハマドさん

# وَلَدٌ
source: Boy
fr: Garçon
ja: 子供

# أَبٌ
source: Father
ja: お父さん

# أَحْمَدُ
source: Ahmed
ja: アーメド

# أَسَدٌ
source: Lion
ja: ライオン

# أُمٌّ
source: Mother
ja: 母親

# اِبْنٌ
source: son
ja: 息子

# بِنْتٌ
source: girl
ja: 娘

# تَاجِرٌ
source: merchant
ja: 商人

# حِصَانٌ
source: horse
ja: 馬

# دِيكٌ
source: rooster
ja: ルースター

# رَضِيعٌ
source: baby
ja: 赤ちゃん

# زُهُورٌ
source: flowers
ja: 花

# شُرْطِيٌّ
source: policeman
ja: 警官

# طَالِبٌ
source: student
ja: 学生

# طَبِيبٌ
source: doctor
ja: 医者

# طِفْلٌ
source: child
ja: 子供

# عَامِلٌ
source: Worker
ja: 労働者

# عُمَّالٌ
source: Workers
ja: 労働者立

# فَاطِمَةُ
source: Fatima
ja: ファーティマ

# فَرَاشَةٌ
source: butterfly
ja: 蝶

# قَاضٌِ
source: judge
ja: 裁判官

# قِطٌّ
source: cat
ja: 猫

# لَيْلَى
source: Layla
ja: レイラ

# معَلِّمٌ
source: Teacher
ja: 先生

# مَرْأَةٌ
source: Woman
ja: 鏡

# مَطَرٌ
source: rain
ja: 雨

# مُحَمَدُ
source: Mohammed
ja: モハメッド

# مُسْلِمٌ
source: Muslim
ja: イスラム教徒

# مُهَنْدِسٌ
source: Engineer
ja: エンジニア

# فعل:
source: Verb:
fr: Verbe:
ja: 動詞

# زمن:
source: Tense:
fr: Temps:
ja: 時間：

# مبني للمعلوم/مجهول:
source: Voice:
fr: Voix:
ja: 情報のための建物/匿名：

# مثبت/منفي:
source: affirmative/negative:
fr: affirmative/négative:
ja: インストール/亡命：

# مفعول
source: Object
fr: Objet
ja: 目的語

# ظرف زمان:
source: Time:
fr: Temps:
ja: 時間の副詞

# ظرف مكان:
source: Place:
fr: Place:
ja: 空間名詞

# بناء
source: Build
fr: Construire
ja: 生成

# عشوائي
source: Random
fr: Aléatoire
ja: ランダム

# عينة
source: sample
fr: Échantillon
ja: サンプル

# حركة الإعراب
source: Inflection mark
fr: Marque d’inflexion
ja: 格変化

# إظهار حركة الإعراب في أواخر الكلمات
source: Show inflection mark on word ending
fr: Montrer la marque d’inflexion sur la fin du mot
ja: 語尾変化表示

# اختيار عشوائي للمفردات
source: Choose words Randomly
fr: Choix aléatoire des mots
ja: 語彙のランダム選択

# نسخ عينة جيسون للتجارب البرمجية
source: Copy a Json sample to make tests
fr: Copier l’échantillon de JSON pour les essais
ja: ソフトウェア実験のためのJasonサンプル

# بناء الجملة
source: Build a phrase
fr: Construire la phrase
ja: 構文

# مدونتي
source: My blog
fr: Mon blog
ja: ブログ

# الاستضافة بدعم من شركة
source: Supported by
fr: Supporté par
ja: サポンサー

source: LanguageCode
fr: fr

source: My Language test
fr: Mon test de langue

source: نوع الجملة:
fr: Type de phrase:

source: جملة فعلية
fr: Phrase verbale

source: جملة اسمية
fr: Phrase nominale

source: فاعل
fr: Sujet

source: أنتما مؤ
fr: Vous (féminins dual)

source: هما مؤ
fr: Elles (Féminin dual)

source: فعل مساعد
fr: Auxiliare

source: الماضي المعلوم
fr: Passé

source: المضارع المعلوم
fr: Présent/Futur

source: مبني للمجهول
fr: passive

source: دَائِمًا
fr: Toujours

source: أَوَّلَ أَمْسِ
fr: Avant-hier

source: الْبَارِحَةَ
fr: Hier la nuit

source: بَعْدَ غَدٍ
fr: Après demain

source: أَمْسِ
fr: Hier

source: الْيَوْمَ
fr: Aujourd'hui

source: كُلَّ يَوْمٍ
fr: Tous les jours

source: بيت
fr: Maison

source: سوق
fr: Marché

source: مدرسة
fr: Ecole
